app/controllers/ebooks_controller.rb

SELECT "ebooks".* FROM "ebooks" ORDER BY id asc
---
  def index
    @ebooks = Ebook.all

INSERT INTO "ebooks" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Mon, 09 Dec 2013 09:18:05 UTC +00:00], ["name", "book1"], ["updated_at", Mon, 09 Dec 2013 09:18:05 UTC +00:00]]
---
  def create
    @ebook = Ebook.new(ebook_params)

    respond_to do |format|
      if @ebook.save

UPDATE "ebooks" SET "name" = $1, "updated_at" = $2 WHERE "ebooks"."id" = 1  [["name", "Book1"], ["updated_at", Mon, 09 Dec 2013 09:27:16 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @ebook.update(ebook_params)

DELETE FROM "ebooks" WHERE "ebooks"."id" = $1  [["id", 4]]
---
  def destroy
    @ebook.destroy

SELECT "ebooks".* FROM "ebooks" WHERE "ebooks"."id" = $1 ORDER BY "ebooks"."id" ASC LIMIT 1  [["id", 24]]
---
    def set_ebook
      @ebook = Ebook.find(params[:id])